from colorama import init, Fore, Style, Back

init(autoreset=True)

version = "1.0.0 [BETA]" 

health_max = 100
level = 0
progress = 0.0

player = {
    "Здоровие": 100,
    "Голод": 0,
    "Жажда": 0,
    "Усталость": 0,

}

items = {
    "Монеты": 0,
    "Дерево": 0,
    "Вода": 0,
    "Железо": 0,
    "Уголь": 0,
    "Лутбокс": 0,
    "Рыба": 0,
    "Еда": {
        "Яблоко": 0
    }
}

tools = {
    "Топор": {
        "Количество": 0,
        "Прочность": 0
    },
    "Кирка": {
        "Количество": 0,
        "Прочность": 0
    },
    "Меч": {
        "Количество": 0,
        "Прочность": 0
    },
    "Ведро": {
        "Количество": 0,
        "Прочность": 0
    },
    "Лодка": {
        "Количество": 0,
        "Прочность": 0
    },
    "Удочка": {
        "Количество": 0,
        "Прочность": 0
    }
}